edgeimpulse/firmware-st-stm32n6/STM32Cube_FW_N6/Drivers/BSP/STM32N6570-DK/stm32n6570_discovery_camera_ov5640.c
  /* Enable GPIO clocks */
  __HAL_RCC_GPIOO_CLK_ENABLE(); // EN Cam
  __HAL_RCC_GPIOD_CLK_ENABLE(); // NRST Cam

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    gpio_init_structure.Pin       = EN_CAM_PIN;
    gpio_init_structure.Pull      = GPIO_NOPULL;
    gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
    gpio_init_structure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init(EN_CAM_PORT, &gpio_init_structure);

    gpio_init_structure.Pin       = NRST_CAM_PIN;
    gpio_init_structure.Pull      = GPIO_NOPULL;
    gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
    gpio_init_structure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    HAL_GPIO_Init(NRST_CAM_PORT, &gpio_init_structure);

    /* Camera sensor Power-On sequence */
    /* Assert the camera Enable and NRST pins */
    HAL_GPIO_WritePin(EN_CAM_PORT, EN_CAM_PIN, GPIO_PIN_SET);
    HAL_GPIO_WritePin(NRST_CAM_PORT, NRST_CAM_PIN, GPIO_PIN_RESET);
    HAL_Delay(200);   /* NRST and Enable signals asserted during 200ms */

    /* De-assert the camera STANDBY pin (active high) */
    HAL_GPIO_WritePin(NRST_CAM_PORT, NRST_CAM_PIN, GPIO_PIN_SET);
    HAL_Delay(3);     /* NRST de-asserted during 3ms */
  }

  return ret;
}

/**
  * @brief  CAMERA power down
  * @param  Instance Camera instance.
  * @retval BSP status
  */
int32_t BSP_CAMERA_PwrDown(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;
  GPIO_InitTypeDef gpio_init_structure = {0};

  if (Instance >= CAMERA_INSTANCES_NBR)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    gpio_init_structure.Pin       = EN_CAM_PIN;
    gpio_init_structure.Pull      = GPIO_NOPULL;
    gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
    HAL_GPIO_Init(EN_CAM_PORT, &gpio_init_structure);

    gpio_init_structure.Pin       = NRST_CAM_PIN;
    gpio_init_structure.Pull      = GPIO_NOPULL;
    gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
    HAL_GPIO_Init(NRST_CAM_PORT, &gpio_init_structure);

    /* Camera power down sequence */
    /* Assert the camera Enable pin (active high) */
    HAL_GPIO_WritePin(EN_CAM_PORT, EN_CAM_PIN, GPIO_PIN_RESET);

    /* De-assert the camera NRST pin (active low) */
    HAL_GPIO_WritePin(NRST_CAM_PORT, NRST_CAM_PIN, GPIO_PIN_RESET);

  }

  return ret;
}

/**
  * @brief  This function handles DCMIPP interrupt request.
  * @param  Instance Camera instance
  * @retval None
  */
void BSP_CAMERA_IRQHandler(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Instance);

  HAL_DCMIPP_IRQHandler(&hcamera_dcmipp);
}

/**
  * @brief  Line Event callback.
  * @param  Instance Camera instance.
  * @retval None
  */
__weak void BSP_CAMERA_LineEventCallback(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Instance);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_DCMIPP_PIPE_LineEventCallback could be implemented in the user file
   */
}

/**
  * @brief  Frame Event callback.
  * @param  Instance Camera instance.
  * @retval None
  */
__weak void BSP_CAMERA_FrameEventCallback(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Instance);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_DCMIPP_PIPE_FrameEventCallback could be implemented in the user file
   */
}

/**
  * @brief  Vsync Event callback.
  * @param  Instance Camera instance.
  * @retval None
  */
__weak void BSP_CAMERA_VsyncEventCallback(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Instance);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_DCMIPP__PIPE_VsyncEventCallback could be implemented in the user file
   */
}

/**
  * @brief  Pipe Error callback.
  * @param  Instance Camera instance.
  * @retval None
  */
__weak void BSP_CAMERA_PipeErrorCallback(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Instance);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_DCMIPP_PIPE_ErrorCallback could be implemented in the user file
   */
}

/**
  * @brief  Error callback.
  * @param  Instance Camera instance.
  * @retval None
  */
__weak void BSP_CAMERA_ErrorCallback(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Instance);

  /* NOTE : This function Should not be modified, when the callback is needed,
            the HAL_DCMIPP_ErrorCallback could be implemented in the user file
   */
}

#if (USE_HAL_DCMIPP_REGISTER_CALLBACKS == 0) || !defined(USE_HAL_DCMIPP_REGISTER_CALLBACKS)
/**
  * @brief  Line event callback
  * @param  hdcmipp  pointer to the DCMIPP handle
  * @retval None
  */
void HAL_DCMIPP_PIPE_LineEventCallback(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdcmipp);

  BSP_CAMERA_LineEventCallback(0);
}

/**
  * @brief  Frame event callback
  * @param  hdcmipp pointer to the DCMIPP handle
  * @retval None
  */
void HAL_DCMIPP_PIPE_FrameEventCallback(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdcmipp);

  BSP_CAMERA_FrameEventCallback(0);
}

/**
  * @brief  Vsync event callback
  * @param  hdcmipp pointer to the DCMIPP handle
  * @retval None
  */
void HAL_DCMIPP_PIPE_VsyncEventCallback(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdcmipp);

  BSP_CAMERA_VsyncEventCallback(0);
}

/**
  * @brief  Pipe Error callback
  * @param  hdcmipp pointer to the DCMIPP handle
  * @retval None
  */
void HAL_DCMIPP_PIPE_ErrorCallback(DCMIPP_HandleTypeDef *hdcmipp, uint32_t Pipe)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdcmipp);

  BSP_CAMERA_PipeErrorCallback(0);
}

/**
  * @brief  Error callback
  * @param  hdcmipp pointer to the DCMIPP handle
  * @retval None
  */
void HAL_DCMIPP_ErrorCallback(DCMIPP_HandleTypeDef *hdcmipp)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hdcmipp);

  BSP_CAMERA_ErrorCallback(0);
}
#endif /*(USE_HAL_DCMIPP_REGISTER_CALLBACKS == 0) || !defined(USE_HAL_DCMIPP_REGISTER_CALLBACKS) */

/**
  * @}
  */

